import{_ as n,c as p,o as r,ag as o}from"./chunks/framework.D4Vqf8I7.js";const P=JSON.parse('{"title":"","description":"","frontmatter":{},"headers":[],"relativePath":"docs/disciplines/pm3/mdk31/index.md","filePath":"docs/disciplines/pm3/mdk31/index.md","lastUpdated":1754481279000}'),d={name:"docs/disciplines/pm3/mdk31/index.md"};function t(c,e,a,s,V,i){return r(),p("div",null,e[0]||(e[0]=[o(`<p>Если мы отказываемся от работы с кабелиными линиями и детальное изучение проектирования объектов, хотя часть этого будет ТФУПД и МДК0102, Мы переходим к множеству разрозенных сервисов и созданию сложной виртуальной (ибо гипервизоры) инфраструктуры</p><p><a href="https://www.basealt.ru/altpve-edu" target="_blank" rel="noreferrer">https://www.basealt.ru/altpve-edu</a></p><p>Тема 1. Введение в виртуализацию</p><pre><code>Определение и преимущества виртуализации
История и принципы виртуализации
Основные концепции виртуализации
Типы виртуализации
Обзор гипервизоров
Особенности ОС «Альт Виртуализация редакция PVE»
</code></pre><p>Тема 2. QEMU/KVM</p><pre><code>Введение в QEMU и KVM
Установка и настройка KVM
Управление виртуальными машинами в QEMU/KVM
Использование утилит и инструментов
Виртуальные диски и хранилища
Сетевые настройки и виртуальные сети
</code></pre><p>Тема 3. Альт Виртуализация редакция PVE</p><pre><code>Введение в Proxmox Virtual Environment (PVE)
Установка PVE
Базовые возможности web-интерфейса PVE
Управление виртуальными машинами в PVE
</code></pre><p>Тема 4. Легковесная виртуализация в PVE</p><pre><code>Разница между контейнерами и виртуальными машинами
Работа с шаблонами контейнеров
Создание и управление LXC-контейнерами
Управление ресурсами контейнеров
</code></pre><p>Тема 5. Организация виртуальных сетей средствами PVE</p><pre><code>Основы сетевой инфраструктуры PVE
Типы сетевых интерфейсов в PVE
Работа с bridge-интерфейсами
Конфигурация VLAN в PVE
Настройка NAT и маршрутизация в PVE
Безопасность сетей в PVE
Настройка OVS
SDN
</code></pre><p>Тема 6. Хранилища и репликация данных PVE</p><pre><code>Основы хранилищ в Proxmox VE
Конфигурация локальных хранилищ
Настройка сетевых хранилищ
</code></pre><p>Тема 7. Кластеризация и высокая доступность в PVE</p><pre><code>Основные понятия кластеризации
ребования к сборке кластера
Создание и управление кластером PVE
Введение в высокую доступность (HA)
Настройка высокой доступности в PVE
Мониторинг и управление HA-кластером
Отказоустойчивость и восстановление
</code></pre><p>Тема 8. Безопасность и управление доступом</p><pre><code>Управление пользователями и ролями
Настройка аутентификации
Обновление и защита
</code></pre><p>Тема 9. Резервное копирование и восстановление</p><pre><code>Методы резервного копирования в PVE
Введение в Proxmox Backup Server
Автоматизация резервного копирования
Восстановление ВМ и контейнеров
</code></pre><p>Тема 10. Администрирование PVE из командной строки</p><pre><code>Доступ к командной оболочке
Варианты получения справочной информации в GNU/Linux
Базовая справочная информация по командам
Операции с виртуальными машинами из командной строки
Преобразование образов жёстких дисков из чужеродных форматов в формат raw/qcow2
Операции с хранилищами из командной строки
</code></pre>`,22)]))}const _=n(d,[["render",t]]);export{P as __pageData,_ as default};
